[
	{
		"version": "2.0.1",
		"date": "2022-10-13",
		"release-notes": [
			"- Fixed being able to detach vehicles from the transport when inside the transport."
		]
	},
	{
		"version": "2.0.0",
		"date": "2022-10-07",
		"release-notes": [
			"- Completely reworked the entire script.",
			"  - Removed all C# code and replaced it with Lua for ease of use.",
			"  - Added some encryption to the script. (~125 out of ~800 lines)",
			"- Onesync only. No more non-Onesync compatibility.",
			"  - Now relying on entity state bags.",
			"- Way better performance.",
			"- TransportCreator rebuild in Luas version of OOP.",
			"  - Transport data remained the same.",
			"  - Can now be used anytime as long as permission is given to the commands. No need to start it in DEBUG mode anymore.",
			"- Fixed several problems with the old version.",
			"  - Most notably: Ramp attaching/detaching synced properly. No more \"under the floor spawns\" etc."
		]
	},
	{
		"version": "1.8.1",
		"date": "2022-03-15",
		"release-notes": [
			"- Fixed ramp spawning."
		]
	},
	{
		"version": "1.8",
		"date": "2022-03-07",
		"release-notes": [
			"- Added events for attaching and detaching vehicles that can be used in other scripts (check the readme for more).",
			"- transportData.json is now automatically updated when creating a new transport. No more copy-pasting necessary; only a script restart.",
			"- transportData.json is also now backed up once before a new transport is created.",
			"- Now spawns the ramp on serverside for onesync servers to prevent a bug related to onesync infinity.",
			"- Fixed the ramp position not being set correctly when creating a new transport.",
			"- Fixed vehicles not being detected correctly for some client / server version combinations."
		]
	},
	{
		"version": "1.7",
		"date": "2022-01-24",
		"release-notes": [
			"- Now uses the Escrow encryption for the server sided files. Source code for the DLL's is still included!",
			"- Added a version checker. Displays new updates and patch notes in the server console.",
			"- Fixed an error that could teleport a player into a random vehicle."
		]
	},
	{
		"version": "1.6",
		"date": "2021-04-20",
		"release-notes": [
			"- added a license",
			"- re-added the source code as it was apparently missing from the v1.5 release",
			"- added the possibility to rotate the rampmodel when creating a transport"
		]
	},
	{
		"version": "1.5",
		"date": "2021-03-11",
		"release-notes": [
			"- fixed server side performance (C# overhead to stronk; from ~1.3ms down to 0.00ms)",
			"- added a ramp for the slamtruck for those really low vehicles"
		]
	},
	{
		"version": "1.4",
		"date": "2021-01-23",
		"release-notes": [
			"- Added 3 new vehicles as Transports: avenger, avenger2, slamtruck",
			"- Added the source code to the resource. You are free to modify it for your own version. You are not allowed to re-release it anywhere without getting permission from me.",
			"- Made the source code a lot more readable",
			"- Potentially fixed a bug that occurred only on OneSync Infinity (ramp did not despawn properly)"
		]
	},
	{
		"version": "1.3",
		"date": "2021-01-14",
		"release-notes": [
			"- Added 3 new vehicles as Transports: avenger, avenger2, slamtruck",
			"- Added the source code to the resource.",
			"- Made the source code a lot more readable.",
			"- Potentially fixed a bug that occurred only on OneSync Infinity (ramp did not despawn properly)"
		]
	},
	{
		"version": "1.2",
		"date": "2021-01-12",
		"release-notes": [
			"- Added an option to enable / disable the scripts functionality.",
			"- Fixed a bug that would just make the ramp invisible and not despawn it on non-onesync servers.",
			"- IMPORTANT: If you do not use onesync: change onesync to false in the config.ini!",
			"- If you still encounter the issue with the invisible ramp (even on onesync), change onesync to false in the config! This might have something to do with older server versions."
		]
	},
	{
		"version": "1.1",
		"date": "2021-01-12",
		"release-notes": [
			"- Fixed a bug that would lock the chat when trying to create a new transport",
			"- Added a readMe file, so people that do not come from the forum can read everything they need to know."
		]
	}
]
